/* 數字加密：亂數產生四位數，將每個位數的數字加 7 後除以 10 取餘數，然後第一個數字和第三個數字對調，第二個數字和第四個數字對調。最後印出加密過的數。
** 數字解密：讀入加密過的數字，然後解密為原來的四位數。
** ---------------------------------------------------------------------------------------------------------------------------------------
** 1 * random integers
** 2 * adjust by digits
** *** test with online GDB
*/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
int main()
{
  srand(time(NULL));

  // Encode

  int c1, c2, c3;
  c1 = 1000 + rand() % 9000;  // 1000 + (0 ~ 8999)
  printf("Random Number = %d\n", c1);

  c2 = 0;
  c2 += (c1 / 1000 + 7) % 10 * 1000;
  c2 += (c1 / 100 % 10 + 7) % 10 * 100;
  c2 += (c1 / 10 % 10 + 7) % 10 * 10;
  c2 += (c1 % 10 + 7) % 10;
  printf("Add 7 and divide by 10 = %d\n", c2);

  c3 = 0;
  c3 += c2 / 1000 * 10;
  c3 += c2 / 10 % 10 * 1000;
  c3 += c2 % 10 * 100;
  c3 += c2 / 100 % 10;

  printf("The Code is %d.\n\n", c3);

  // Decode

  int n1, n2;
  n1 = 0;
  n1 += c3 /1000 * 10;
  n1 += c3 / 10 % 10 * 1000;
  n1 += c3 % 10 * 100;
  n1 += c3 / 100 % 10;

  n2 = 0;
  n2 += ( n1/1000 + 10 - 7 ) % 10 * 1000;
  n2 += ( n1/100 + 10 - 7 ) % 10 * 100;
  n2 += ( n1/10 + 10 - 7 ) % 10 * 10;
  n2 += ( n1 + 10 - 7 ) % 10;

  printf("The Answer is %d.\n\n", n2);

  return 0;
}
